tutorials/Roulund2005_hydro/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;
D 0.536;

xa #calc "-3*$D";
xb #calc "6*$D";
ya #calc "-2.5*$D";
yb #calc "2.5*$D";
za #calc "0*$D";
zb #calc "1*$D";

dx 0.035;
dz 0.025;

nx #calc "std::floor(($xb - $xa) / $dx)";//120
ny #calc "std::floor(($yb - $ya) / $dx)";//95
nz #calc "std::floor(($zb - $za) / $dz)";//24

vertices
(
    ($xa $ya $za) //0
    ($xb $ya $za) //1
    ($xb $yb $za) //2
    ($xa $yb $za) //3
    ($xa $ya $zb) //4
    ($xb $ya $zb) //5
    ($xb $yb $zb) //6
    ($xa $yb $zb) //7
);


blocks
(
    hex (0 1 2 3 4 5 6 7) ($nx $ny $nz) simpleGrading (1 1 7)
);

edges
(
);

patches
(
    patch top 
    (
        (4 5 6 7)        
    )
    wall bottom
    (
        (0 3 2 1)    
    )
    patch inlet
    (
        (0 4 7 3)
    )
    patch outlet
    (
        (2 6 5 1)
    )
    patch frontAndBack
    (
        (0 4 5 1)
        (3 7 6 2)
    )
);

mergePatchPairs
(
);

// ************************************************************************* //
