tutorials/Roulund2005_hydro/constant/immersedBoundaryProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      ibDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// points inside fluid region or computational domain
pointsInFluid ((-0.2 0.2 0.2));

// for searching span (default 3.0)
radiusFactor 2.5;

// samplingPts = hitPts + distFactor*(IBCellCenter-hitPts) (default 1.5)
distFactor 3;

// maximum rows of findCellCells (gamma>0) (default 4.0)
maxCellCellRows 3;

// hit points for each interpolation stencil from 3D to 2D
triInterpSize 10;

// roughnessHeight for RANS model wall function, default 0, which is smooth
roughnessHeight 0;
roughnessConstant 0.5;
roughnessFactor 1;

updateInterval 1; //default 1

// export surface mesh and its related values time step
extrudeMeshOutputTimeStep 1;

// velocity profile selection, default "two-layer";  Other options: "vanDriest", "Spalding"
wallFunction "vanDriest";

objects
{
	plane
	{
		//IBtype ghost-cell; // ghost-cell or classic
		IBtype classic; // ghost-cell or classic

		dualMeshSwicth true;
		gravity   (0 0 -9.81);

		sediment	
		{
			// fix inlet BC elevation
                        fixInlet true;
                        // ensure mass conservation of sediment
                        feedInlet false;
			bedLoad true; //default true
			suspendedLoad false; //default true
	

			changeSTL false; // default true, otherwise only calculate values
	
			//sediment transport
			gravity   (0 0 -9.81); 
			staticFrictionCoefficient 0.625; //32 degrees
			shieldsNumberC0 0.05; //default 0.098
			specificGravity 2.63; // default 2.69
			grainDiameter 0.00026;
			deformScale 1; // default 1
                        //sand slide settings
			sandSlide true; // default true
                        sand_slide_err1 5e-5;
                        sand_slide_err2 1e-5;
                        sandSlide_maxItr 200;
                        sandSlide_diffusivity 0.0005;
                        sandSlide_timeStep  0.001;
                        //suspended load
			referenceHeight -1; // default -1, suggest 0.05 * water depth			
			VsModel "Fredse1992"; // default constant
			V0 (0 0 -5.0e-3); // no default
 		}
		
	}
}


// ************************************************************************* //
